# Important.
tap "buo/cask-upgrade"
brew "mas"

# Taps.
tap "bradyjoslin/sharewifi"
tap "buo/cask-upgrade"
tap "homebrew/autoupdate"
tap "koekeishiya/formulae"
tap "morantron/tmux-fingers"
tap "owenthereal/upterm"

# Brew Formulae.
brew "act"
brew "age"
brew "ca-certificates"
brew "xz"
brew "tree"
brew "aria2"
brew "asciidoctor"
brew "bash"
brew "bash-completion@2"
brew "bat"
brew "bore-cli"
brew "brightness"
brew "chatblade"
brew "chezmoi"
brew "clang-format"
brew "cmake"
brew "cmake-docs"
brew "cocoapods"
brew "coreutils"
brew "crystal"
brew "curl"
brew "direnv"
brew "dockerfmt"
brew "dockutil"
brew "dotnet"
brew "dust"
brew "eza"
brew "tesseract"
brew "ffmpeg"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "git-sizer"
brew "glances"
brew "glow"
brew "gnu-getopt"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "grpcurl"
brew "hadolint"
brew "has"
brew "hstr"
brew "httpie"
brew "hub"
brew "imagemagick"
brew "iperf3"
brew "jq"
brew "just"
brew "lazygit"
brew "librsvg"
brew "lua-language-server"
brew "mosh"
brew "mtr"
brew "navi"
brew "utf8proc"
brew "neovim"
brew "netcat"
brew "ngrep"
brew "nixfmt"
brew "nmap"
brew "node"
brew "onefetch"
brew "openvino"
brew "p7zip"
brew "pam-reattach"
brew "parallel"
brew "pinentry-mac"
brew "pngpaste"
brew "prettier"
brew "prettierd"
brew "procs"
brew "pv"
brew "pyenv"
brew "ripgrep"
brew "shellcheck"
brew "shfmt"
brew "sl"
brew "socat"
brew "starship"
brew "stylelint"
brew "stylua"
brew "swift-format"
brew "swiftformat"
brew "swiftlint"
brew "switchaudio-osx"
brew "syncthing"
brew "tealdeer"
brew "tmux"
brew "tmuxinator"
brew "tokei"
brew "tree-sitter-cli"
brew "typos-cli"
brew "vapor"
brew "watch"
brew "websocat"
brew "weechat"
brew "wget"
brew "wireshark"
brew "xcbeautify"
brew "xcode-build-server"
brew "xcodegen"
brew "yamlfmt"
brew "yarn"
brew "yq"
brew "zellij"
brew "zoxide"
brew "koekeishiya/formulae/skhd"
brew "morantron/tmux-fingers/tmux-fingers"

# Casks.
cask "alcove"
cask "anki"
cask "anydesk"
cask "apple-juice"
cask "balenaetcher"
cask "brave-browser"
cask "cardhop"
cask "dash"
cask "discord", args: { appdir: "/Applications" }
cask "docker-desktop"
cask "dropbox"
cask "element"
cask "espanso"
cask "fantastical"
cask "firefox"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "ghostty"
# cask "google-chrome", args: { appdir: "/Applications" }
cask "karabiner-elements", args: { appdir: "/Applications" }
cask "keepassxc", args: { appdir: "/Applications" }
cask "kitty", args: { appdir: "/Applications" }
cask "lunar"
cask "microsoft-auto-update"
cask "microsoft-office"
cask "mitmproxy"
cask "mu-editor"
cask "obs"
cask "obsidian"
cask "openemu"
cask "postman"
cask "raspberry-pi-imager"
cask "raycast"
cask "retroarch-metal"
cask "rocket"
cask "signal", args: { appdir: "/Applications" }
cask "slack", args: { appdir: "/Applications" }
cask "steam"
cask "tor-browser"
cask "torguard"
cask "vanilla"
cask "zen"
cask "zoom", args: { appdir: "/Applications" }

# Mac App Store apps.
mas "Actions", id: 1586435171
mas "Drafts", id: 1435957248
mas "Dropover", id: 1355679052
mas "Flighty", id: 1358823008
mas "Session", id: 1521432881
mas "Strongbox", id: 897283731
mas "TestFlight", id: 899247664
mas "Transporter", id: 1450874784
mas "Xcode", id: 497799835

# OpenHue
tap "openhue/cli"
brew "openhue/cli/openhue-cli"
